Repository: jakb2403/Logic-Circuit-Simulator
Catalog: *.po
Languages: french

source: Choose devices to monitor:
french: Choisir appareiles à moniteur:

source: Command Line
french: Ligne de Commande

source: File
french: Dossier

source: Monitor Points
french: Pointes de Moniteur

source: Control Switches
french: Panneau de Contrôle

source: Logic Simulator
french: Simulater Logique

source: Logic Simulator: interactive command line user interface
french: Simulateur Logique: interactif ligne de commande interface grafique

source: Enter 'h' for help
french: Inscrire 'h' pour assistance

source: User commands
french: Commandes de utilateur

source: Invalid command
french: Commande non valide

source: run the simulation for N cycles
french: faire tourner le simulation pour N cycles

source: continue the simulation for N cycles
french: continuer le simulation pour N cycles

source: set switch X to N (0 or 1)
french: poser interrupteur X à N

source: set a monitor on signal X
french: poser un pointe de moniteur sur signal X

source: zap the monitor on
french: zapper le pointe de moniteur allumé

source: help (this command)
french: assistance (cette commande)

source: quit the progam
french: quitter le programme

source: Running for N cycles
french: Gestion pour N cycles.

source: Error! Expected a number.
french: Erreur! Attendu un nombre.

source: Continuing for N cycles. Total N
french: En cours pour N cycles. Total N

source: Error! Nothing to continue. Run first.
french: Erreur! Rien a continuer. Faire tourner premier.

source: Successfully set switch.
french: Poser avec succès le interrupteur.

source: Error! Invalid switch.
french: Erreur! Nom inconnu.

source: Number out of range.
french: Nombre hors de portée

source: Successfully made monitor.
french: Fait avec succès le pointe de moniteur.

source: Error! Could not make monitor.
french: Erreur! Ne pouvait pas faire le pointe de moniteur.

source: Error! Unkown name.
french: Erreur! Nom inconnu.

source: Successfully zapped monitor.
french: Éliminer avec succès le pointe de moniteur.

source: Error! Could not zap monitor.
french: Erreur! Ne pouvait pas éliminer le pointe de moniteur.

source: Error! Network oscillating.
french: Erreur! Réseau oscillant.

source: invalid device name
french: nom de l'appareil non valide

source: device type '{}' cannot be device name
french: genre de l'appareil '{}' ne peut pas être un nom

source: dtype input/output '{}' cannot be device name
french: dtype entrée/sortie '{}' ne peut pas être un nom

source: keyword '{}' cannot be device name
french: mot-clé '{}' ne peut pas être un nom

source: invalid argument type
french: genre de données non valide

source: invalid port identifier
french: le identifiant de le port non valide

source: missing symbol: {}
french: symbole manquant: {}

source: missing argument for decive type '{}'
french: données manquant por le genre de l'appareil '{}'

source: unrecognised device type
french: méconnu genre de l'appareil

source: missing keyword {}
french: mot-clé manquant {}

source: argument outside of accepted range
french: données en dehors de la plage acceptée

source: name already used in previous device assignment
french: nom déjà utilisé dans l'attribution précédente de l'appareil

source: monitor point already declared
french: pointe de moniteur est déjà déclaré

source: monitor point is an input, only outputs are allowed
french: pointe de moniteur est une entrée, seules les sorties sont autorisées

source: input connected to input
french: entrée connectée à l'entrée

source: output connected to output
french: sortie connectée à la sortie

source: port is absent
french: port manquant

source: input is already connected
french: l'entrée est déjà connectée
