Repository: jakb2403/Logic-Circuit-Simulator
Catalog: locale/logsim_*.po
Languages: fr

source: 논리 회로 모의 실험 Logic Simulator
fr: 논리 회로 모의 실험 Simulateur Logique

source: &About
fr: &À propos de Logsim

source: &Exit
fr: &Quitter

source: &File
fr: &Fichier

source: Load
fr: Charger

source: Run
fr: Exécuter

source: Continue
fr: Continuer

source: Status
fr: Statut

source: Monitor Points
fr: Surveiller les points

source: Control Switches
fr: Contrà´ler les interrupteurs

source: Replace Connections
fr: Remplacer les connexions

source: Command Line
fr: Ligne de commande

source: You closed the file dialog box. You must choose a file to load in order to run a simulation
fr: Vous avez fermé la boîte de dialogue du fichier. Vous devez choisir un fichier à charger pour exécuter une simulation

source: Load a .txt file to run
fr: Charger un fichier .txt à exécuter

source: Opening file:
fr: Ouverture du fichier:

source: Parsing file:
fr: Analyse du fichier:

source: Save monitor plot
fr: Enregistrer le tracé du moniteur

source: Cannot save current data in file '{}'.
fr: Impossible d'enregistrer les données actuelles dans le fichier '{}'.

source: Saved file as:
fr: Fichier enregistré sous:

source: Logic Simulator Created by Mojisola Agboola Adapted by P3 Group 15 Hyun Seung Cho, Joe Waters and John Brown 2022
fr: Simulateur logique Créé par Mojisola Agboola Adapté par P3 Groupe 15 Hyun Seung Cho, Joe Waters et Jean Marron 💩 2022

source: About Logsim
fr: À propos de Logsim

source: Choose devices to monitor:
fr: Choisir les appareils à surveiller:

source: Monitor Signals
fr: Surveillez les signaux

source: Device {} added to monitor points
fr: Appareil {} ajouté aux points de surveillance

source: Device {} zapped from monitor points
fr: Appareil {} zappé des points de surveillance

source: Change state of switches:
fr: Changer l'état des interrupteur:

source: Switch {} toggled to {}
fr: Interrupteur {} changé à {}

source: Replacing connection {} > {} with {} > {}
fr: Remplacement de la connexion {} > {} avec {} > {}

source: Invalid command. Enter 'h' for help.
fr: Commande invalide. Entrez 'h' pour obtenir de l'aide.

source: Error! Expected a name.
fr: Erreur! Un nom est attendu.

source: Error! Unknown name.
fr: Erreur! Nom inconnu.

source: Error! Expected a number.
fr: Erreur! Un nombre attendu.

source: Number out of range.
fr: Nombre hors limites.

source: User commands:
fr: Commandes utilisateur:

source: r N - run the simulation for N cycles
fr: r N - exécuter la simulation pendant N cycles

source: c N - continue the simulation for N cycles
fr: c N - continuer la simulation pendant N cycles

source: s X N - set switch X to N (0 or 1)
fr: s X N - régler le interrupteur X à N (0 ou 1)

source: m X - set a monitor on signal X
fr: m X - régler un moniteur sur le signal X

source: z X - zap the monitor on signal X
fr: z X - zappe le moniteur sur le signal X

source: h - help (this command)
fr: h - aide (cette commande)

source: q - quit the program
fr: q - quitter le programme

source: Successfully set switch.
fr: Interrupteur réglé avec succès.

source: Error! Invalid switch.
fr: Erreur! Commutateur invalide.

source: Successfully made monitor.
fr: Moniteur créé avec succès.

source: Error! Could not make monitor.
fr: Erreur! Impossible de faire le moniteur.

source: Successfully zapped monitor
fr: Moniteur zappé avec succès

source: Error! Could not zap monitor.
fr: Erreur! Impossible de zapper le moniteur.

source: Error! Network oscillating.
fr: Erreur! Réseau oscillant.

source: Running for
fr: Courir pour

source: Error! Nothing to continue. Run first.
fr: Erreur! Rien à continuer. Courez d'abord.

source: Continuing for
fr: Continuer pour

source: Replace ...
fr: Remplacer ...

source: with ...
fr: avec ...

source: Replace
fr: Replacer

source: Choose a connection to replace:
fr: Choisir une connexion à remplacer:

source: Logic Simulator: interactive command line user interface. Enter 'h' for help.
fr: Simulateur Logique: interface utilisateur interactive en ligne de commande. Entrez 'h' pour obtenir de l'aide.

source: Usage: Show help: logsim.py -h Command line user interface: logsim.py -c <file path> Graphical user interface: logsim.py This will bring up a file dialog where you can choose the file you wish to run.
fr: Usage: Afficher l'aide : logsim.py -h Interface utilisateur de ligne de commande : logsim.py -c <chemin du fichier> Interface utilisateur graphique : logsim.py Cela fera apparaître une boîte de dialogue de fichier dans laquelle vous pourrez choisir le fichier que vous souhaitez exécuter.

source: Error: invalid command line arguments
fr: Erreur: arguments de ligne de commande non valides

source: Logic Simulator: interactive command line user interface. Enter 'h' for help.
fr: Logic Simulator: interface utilisateur interactive en ligne de commande. Entrez 'h' pour obtenir de l'aide.

source: invalid device name
fr: nom de périphérique invalide

source: device type '{}' cannot be device name
fr: le type d'appareil '{}' ne peut pas être le nom de l'appareil

source: dtype input/output '{}' cannot be device name
fr: dtype input/output '{}' ne peut pas être le nom du périphérique

source: keyword '{}' cannot be device name
fr: le mot-clé '{}' ne peut pas être le nom de l'appareil

source: invalid argument type
fr: type d'argument invalide

source: invalid port identifier
fr: “identifiant de port invalide

source: missing symbol: {}
fr: symbole manquant: {}

source: missing argument for decive type '{}'
fr: argument manquant pour le type de décision '{}'

source: unrecognised device type
fr: “type d'appareil non reconnu

source: missing keyword '{}'
fr: mot clé manquant '{}'

source: argument '{}' outside of accepted range
fr: argument '{}' en dehors de la plage acceptée

source: name '{}' already used in previous device assignment
fr: “nom '{}' déjà utilisé dans l'attribution de périphérique précédente

source: monitor point '{}' already declared
fr: point de contrôle '{}' déjà déclaré

source: monitor point is an input, only outputs are allowed
fr: le point de contrôle est une entrée, seules les sorties sont autorisées

source: input connected to input
fr: entrée connectée à l'entrée

source: output connected to output
fr: sortie connectée à la sortie

source: port is absent
fr: le port est absent

source: input is already connected
fr: l'entrée est déjà connectée

source: incomplete network, not all inputs are connected
fr: réseau incomplet, toutes les entrées ne sont pas connectées

source: incorrect ordering of sections
fr: ordre incorrect des sections

source: Error Count: {}
fr: Nombre d'erreurs: {}

source: Error:
fr: Erreur:

source: Error: incorrect file type
fr: Erreur: type de fichier incorrect

source: Error invalid path
fr: Erreur chemin invalide

source: Error on line
fr: Erreur en ligne
